Revit 2026 API

# GradientGradientType Property

---

The property labeled "Gradient Type" from the "Gradient" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GradientType { get; }
```
```vb
Public Shared ReadOnly Property GradientType As String
	Get
```
```cpp
public:
static property String^ GradientType {
	String^ get ();
}
```
```fsharp
static member GradientType : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "GradientType".

#### Reference

Gradient Class

Autodesk.Revit.DB.Visual Namespace